export const apiKey = 'AIzaSyDxNydOgSX28wR-aG8l_whwfa28nwcZs84'
export const projectId = 'academic-vdata-2016'
export const authDomain = `${projectId}.firebase.com`
export const surveyURL = 'https://survey2015.symposium-hp.jp/apply.php'
export const sympoURL = 'http://www.cpier.kyoto-u.ac.jp/2016/11/shinagawa/'
export const databaseURL = 'https://academic-vdata-2016.firebaseio.com'
export const supportEmail = 'imaishinsuke+academic-vdata@gmail.com'
export const googleAnalyticsId = 'UA-89088103-1'
export const storageBucket = 'gs://academic-vdata-2016.appspot.com'
export const c40 = [
  '#3182bd',
  '#6baed6',
  '#9ecae1',
  '#c6dbef',
  '#e6550d',
  '#fd8d3c',
  '#fdae6b',
  '#fdd0a2',
  '#31a354',
  '#74c476',
  '#a1d99b',
  '#c7e9c0',
  '#756bb1',
  '#9e9ac8',
  '#bcbddc',
  '#dadaeb',
  '#636363',
  '#969696',
  '#bdbdbd',
  '#d9d9d9',
  '#393b79',
  '#5254a3',
  '#6b6ecf',
  '#9c9ede',
  '#637939',
  '#8ca252',
  '#b5cf6b',
  '#cedb9c',
  '#8c6d31',
  '#bd9e39',
  '#e7ba52',
  '#e7cb94',
  '#843c39',
  '#ad494a',
  '#d6616b',
  '#e7969c',
  '#7b4173',
  '#a55194',
  '#ce6dbd',
  '#de9ed6'
]
export const questionRankColors = [
  '#507FBF',
  '#BFD0E9',
  '#FAC5C7',
  '#F75E60'
]
export const questionGradual = [
  '全く当てはまらない',
  '当てはならない',
  '当てはまる',
  'かなり当てはまる'
]
export const questionItems = {
  'A01': '私は、研究の価値は、「新しいもの・概念を生み出すこと」にこそあるべきだと考える',
  'A02': '私は、研究の価値は、「深い理解に到達すること」にこそあるべきだと考える',
  'A03': '私は、研究の価値は、「成果を活用してインパクトを与えること」にこそあるべきだと考える',
  'A04': '私は、研究の価値は、「社会課題の解決」にこそあるべきだと考える',
  'A05': '私は、価値中立的な科学的研究は分野を問わず可能であると考える',
  'A06': '私にとって、研究は、「生活をするための職業」でしかない',
  'A07': '私にとって、研究は、「人生をかけるべきもの」であり、それだけの価値がある',
  'A08': '私にとって、研究は、「ツール」であり活用している（社会に応用するための、課題解決するための、あるいは、自己表現のためのもの）',
  'A09': '私にとって、論文とは、「キャリアアップのための道具」でしかない',
  'A10': '私にとって、論文とは、知の探究の結果である',
  'A11': '私にとって、論文とは、研究課題を達成するための１ステップである',
  'A12': '私にとって、論文とは、「研究者でいることの単なる証明」である',
  'A13': '私にとって、論文は、「本数稼ぎの論文」と「本気の論文」が存在する',
  'A14': '私は、良い研究の為には、「個人でコツコツ取り組むよりも、他者と活発に議論すること」であると思う',
  'A15': '私は、良い研究の為には、「様々な分野とつながること」が絶対に必要であると思う',
  'A16': '私は、良い研究の為には、「多方面で活発に活動すること」が絶対に必要であると思う',
  'A17': '私は、良い研究の為には、とにかく「専門分野一筋で取り組むこと」であると思う',
  'A18': '私は、自らの研究において異分野融合が必要だと思う',
  'A19': '私は、知の獲得に至る根本的なルートは、「体系的な推論（理論、論理）である」と考える',
  'A20': '私は、知の獲得に至る根本的なルートは、「知覚的経験（観察や実験）である」と考える',
  'A21': '私は、研究では、自分自身と「対象を完全に切り離すこと」が必要であると思う（自らの価値観は全く入れない）',
  'A22': '私は、研究では、自分自身も「対象の一部であるととらえること」が必要であると思う',
  'A23': '私は、論文を書くためには、「お金の確保がなによりも大事」だと思う',
  'A24': '私は、所属する研究分野の「他分野に対する影響力が、将来的にさらに拡大してほしい」と思う',
  'A25': '私は、所属する研究分野は、「他分野に関心を払う必要などなく、分野独自にとにかく真理を追究すること」が求められると思う',
  'A26': '私は、所属する研究分野は、現状からみて、「これからさらに社会に求められ、伸びる分野である」と思う',
  'A27': '私は、世界には、「全ての事象を説明できる絶対的な法則がある」と考える',
  'A28': '私は、世界というものは、「完全に要素機能（部品）から構成されたものである」と考える',
  'A29': '私は、世界というものは、「完全に有機的な生命体である」と考える',
  'A30': '私は、世界というものは、「完全に概念的なものであり自分が知覚した現象はそのまま本当に「在る」かどうかはわからない」と考える',
  'A31': '私は、世界というものは、「完全に実在しており自分が知覚した現象は実際にそれが在ることに他ならない」と考える',
  'A32': '私は、個人は、「集団（社会）を構成する一単位にすぎない存在である」と考える',
  'A33': '私は、集団（社会）は、「個人のために存在する」と考える',
  'A34': '私は、人間は、「自然の一部としての存在である」と考える',
  'A35': '私は、人間は、「他の動物とは全く異なる存在である」と考える',
  'A36': '私は、人間は、「機械的に理解できる存在である」と考える',
  'A37': '私は、人間は、「社会においてはじめて人間になる存在である」と考える',
  'A38': '私は、人間の中核は、「感情や衝動、欲望よりも、理性である」と考える',
  'A39': '私は、研究では、成果として、「論文が著書より評価される」と感じる',
  'A40': '私は、研究では、成果として、「論文と著書が同等に評価される」と感じる',
  'A41': '私は、研究では、成果として、「翻訳がかなり評価される」と思う',
  'A42': '私は、研究では、成果として、「社会貢献や企業・ＮＰＯ等の兼業がかなり評価される」と思う',
  'A43': '私は、研究では、成果として、「招待講演や基調講演がかなり評価される」と思う',
  'A44': '私は、研究では、成果として、「文科省や行政等の公的な委員を務めることがかなり評価される」と思う',
  'A45': '私は、研究では、成果として、「テキストや啓蒙書の執筆がかなり評価される」と思う',
  'A46': '私は、研究では、成果として、「メディアの露出（テレビ、新聞等）がかなり評価される」と思う',
  'A47': '私は、研究では、成果として、「複数分野で業績があることがかなり評価される」と思う',
  'A48': '私は、研究では、成果として、「研究集会を自ら主催することがかなり評価される」と思う',
  'A49': '私は、研究では、成果として、「海外で行われている新たな研究手法を国内に紹介することがなにより評価される」と思う',
  'A50': '私は、研究では、成果として、「既存の理論の新たな解釈がなにより評価される」と思う',
  'A51': '私は、研究では、「結果がなにより重視される」と感じる',
  'A52': '私は、研究では、「プロセスがなにより重視される」と感じる',
  'A53': '私は、研究のために、「研究室（ゼミ）には一体感が絶対に必要である」と思う',
  'A54': '私は、所属する研究室（ゼミ）を、なんといっても「人材育成、チームワーク、メンバーの研究室への献身が重視される場」にしたい',
  'A55': '私は、所属する研究室（ゼミ）を、なんといっても「独創的または革新的な考え方を持っていることが重視される場」にしたい',
  'A56': '私は、所属する研究室（ゼミ）を、なんといっても「研究分野内でトップを走ること、ライバル研究室をしのぐことが重視される場」にしたい',
  'A57': '私は、所属する研究室（ゼミ）を、なんといっても「効率性が高いことが重視される場」にしたい',
  'A58': '私は、所属する研究室（ゼミ）で各個人に求められるリーダーシップとは、「後輩を育て、人々を助けることが第1だ」と考える',
  'A59': '私は、所属する研究室（ゼミ）で各個人に求められるリーダーシップとは、「革新的であり、リスクを進んでとることが第1だ」と考える',
  'A60': '私は、所属する研究室（ゼミ）で各個人に求められるリーダーシップとは、「現実的で、活動的で、結果至上主義であることが第1だ」と考える',
  'A61': '私は、所属する研究室（ゼミ）で各個人に求められるリーダーシップとは、「調整を行い、組織化し、効率的なことが第1だ」と考える',
  'B01': '私は、研究のために、国の政策動向に敏感であることが必須であると思い、常に注目している',
  'B02': '私は、研究のために、外部資金を積極的にとりに行っている',
  'B03': '私は、研究のために、様々な他の分野とつながりたいと思い、そのための行動をしている',
  'B04': '私は、研究のために、研究室（ゼミ）で仲良くしたいと思い、そのための行動をしている',
  'B05': '私は、研究は、基本的に研究者2人以上のチームで行う',
  'B06': '私は、研究する際に、1人ではなく研究を手伝ってくれる技術補佐員的な人的資源が必須であると思う',
  'B07': '私は、研究では、自らの主義を常に意識している',
  'B08': '私は、研究では、自らの立ち位置を常に意識している',
  'B09': '私は、研究では、所属する研究室の歴史や系譜を重視している',
  'C01': '私は、「音楽・リズム知能」が高いと思う',
  'C02': '私は、「対人的知能」が高いと思う',
  'C03': '私は、「論理・数学的知能」が高いと思う',
  'C04': '私は、「博物学的知能」が高いと思う',
  'C05': '私は、「視覚・空間的知能が高いと思う',
  'C06': '私は、「内省的知能」が高いと思う',
  'C07': '私は、「言語・語学知能」が高いと思う',
  'C08': '私は、「身体・運動感覚知能」が高いと思う',
  'D01': '私は、学生（院生）の時に所属していた研究室（ゼミ）では、研究テーマを決める際には、自らの意見がなによりも重視されたと思う',
  'D02': '私は、学生（院生）の時に所属していた研究室（ゼミ）では、教員と学生の関係は完全に対等であったと思う',
  'D03': '私は、所属する研究室（ゼミ）には、かなりの一体感があると感じる',
  'D04': '私は、所属する研究室（ゼミ）では、飲み会やイベントが頻繁に実施されている',
  'D05': '私は、大学や所属部局への帰属意識が非常に高い',
  'D06': '私は、自分の主たる学会（研究者コミュニティー）への帰属意識が非常に高い',
  'D07': '私は、所属する学会は、一枚岩の団結を誇っている',
  'D08': '私は、所属する研究室（ゼミ）は、なにより「人間的な場所であり、家族の延長のような存在である」と感じる。研究室（ゼミ）では皆、価値観・考えを共有している。',
  'D09': '私は、所属する研究室（ゼミ）は、なにより「変化が激しく、イノベーション精神に溢れた場所である」と感じる。皆あえて危険を冒し、進んでリスクをとる傾向にある。',
  'D10': '私は、所属する研究室（ゼミ）は、なにより「結果至上主義であり、計画の達成が最も大事なことだとされている」と感じる。皆は各領域での目的の達成を重視する。',
  'D11': '私は、所属する研究室（ゼミ）は、なにより「管理され、構造化されている」と感じる。基本的に、形式的な手続きが人々の仕事を規定している。',
  'D12': '私は、基本的に論文を執筆する際に、実際に執筆していなくても、実験や調査に関わった人すべてを「著者」として載せる',
  'D13': '私は、基本的に論文を執筆する際に、執筆にも実験や調査にも直接関わっていない人であっても、関係者であれば「著者」として載せる'
}

export const saimokus = [
  {
    'class': '情報学',
    'subclasses': [
      {
        'subclass': '情報学基礎',
        'fields': {
          '1001': '情報学基礎理論',
          '1002': '数理情報学',
          '1003': '統計科学'
        }
      },
      {
        'subclass': '計算基盤',
        'fields': {
          '1101': '計算機システム',
          '1102': 'ソフトウェア',
          '1103': '情報ネットワーク',
          '1104': 'マルチメディア・データベース',
          '1105': '高性能計算',
          '1106': '情報セキュリティ'
        }
      },
      {
        'subclass': '人間情報学',
        'fields': {
          '1201': '認知科学',
          '1202': '知覚情報処理',
          '1203': 'ヒューマンインタフェース・インタラクション',
          '1204': '知能情報学',
          '1205': 'ソフトコンピューティング',
          '1206': '知能ロボティクス',
          '1207': '感性情報学'
        }
      },
      {
        'subclass': '情報学フロンティア',
        'fields': {
          '1301': '生命・健康・医療情報学',
          '1302': 'ウェブ情報学・サービス情報学',
          '1303': '図書館情報学・人文社会情報学',
          '1304': '学習支援システム',
          '1305': 'エンタテインメント・ゲーム情報学'
        }
      }
    ]
  },
  {
    'class': '環境学',
    'subclasses': [
      {
        'subclass': '環境解析学',
        'fields': {
          '1401': '環境動態解析',
          '1402': '放射線・化学物質影響科学',
          '1403': '環境影響評価'
        }
      },
      {
        'subclass': '環境保全学',
        'fields': {
          '1501': '環境技術・環境負荷低減',
          '1502': '環境モデリング・保全修復技術',
          '1503': '環境材料・リサイクル',
          '1504': '環境リスク制御・評価'
        }
      },
      {
        'subclass': '環境創成学',
        'fields': {
          '1601': '自然共生システム',
          '1602': '持続可能システム',
          '1603': '環境政策・環境社会システム'
        }
      }
    ]
  },
  {
    'class': '複合領域',
    'subclasses': [
      {
        'subclass': 'デザイン学',
        'fields': {
          '1651': 'デザイン学'
        }
      },
      {
        'subclass': '生活科学',
        'fields': {
          '1701': '家政・生活学一般',
          '1702': '衣・住生活学',
          '1703': '食生活学'
        }
      },
      {
        'subclass': '科学教育・教育工学',
        'fields': {
          '1801': '科学教育',
          '1802': '教育工学'
        }
      },
      {
        'subclass': '科学社会学・科学技術史',
        'fields': {
          '1901': '科学社会学・科学技術史'
        }
      },
      {
        'subclass': '文化財科学・博物館学',
        'fields': {
          '2001': '文化財科学・博物館学'
        }
      },
      {
        'subclass': '地理学',
        'fields': {
          '2101': '地理学'
        }
      },
      {
        'subclass': '社会・安全システム科学',
        'fields': {
          '2201': '社会システム工学・安全システム',
          '2202': '自然災害科学・防災学'
        }
      },
      {
        'subclass': '人間医工学',
        'fields': {
          '2301': '生体医工学・生体材料学',
          '2302': '医用システム',
          '2303': '医療技術評価学',
          '2304': 'リハビリテーション科学・福祉工学'
        }
      },
      {
        'subclass': '健康・スポーツ科学',
        'fields': {
          '2401': '身体教育学'
        }
      },
      {
        'subclass': '子ども学',
        'fields': {
          '2451': '子ども学（子ども環境学）'
        }
      },
      {
        'subclass': '生体分子科学',
        'fields': {
          '2501': '生物分子化学',
          '2502': 'ケミカルバイオロジー'
        }
      },
      {
        'subclass': '脳科学',
        'fields': {
          '2601': '基盤・社会脳科学',
          '2602': '脳計測科学'
        }
      }
    ]
  },
  {
    'class': '総合人文社会',
    'subclasses': [
      {
        'subclass': '地域研究',
        'fields': {
          '2701': '地域研究'
        }
      },
      {
        'subclass': 'ジェンダー',
        'fields': {
          '2801': 'ジェンダー'
        }
      },
      {
        'subclass': '観光学',
        'fields': {
          '2851': '観光学'
        }
      }
    ]
  },
  {
    'class': '人文学',
    'subclasses': [
      {
        'subclass': '哲学',
        'fields': {
          '2901': '哲学・倫理学',
          '2902': '中国哲学・印度哲学・仏教学',
          '2903': '宗教学',
          '2904': '思想史'
        }
      },
      {
        'subclass': '芸術学',
        'fields': {
          '3001': '美学・芸術諸学',
          '3002': '美術史',
          '3003': '芸術一般'
        }
      },
      {
        'subclass': '文学',
        'fields': {
          '3101': '日本文学',
          '3102': '英米・英語圏文学',
          '3103': 'ヨーロッパ文学',
          '3104': '中国文学',
          '3105': '文学一般'
        }
      },
      {
        'subclass': '言語学',
        'fields': {
          '3201': '言語学',
          '3202': '日本語学',
          '3203': '英語学',
          '3204': '日本語教育',
          '3205': '外国語教育'
        }
      },
      {
        'subclass': '史学',
        'fields': {
          '3301': '史学一般',
          '3302': '日本史',
          '3303': 'アジア史・アフリカ史',
          '3304': 'ヨーロッパ史・アメリカ史',
          '3305': '考古学'
        }
      },
      {
        'subclass': '人文地理学',
        'fields': {
          '3401': '人文地理学'
        }
      },
      {
        'subclass': '文化人類学',
        'fields': {
          '3501': '文化人類学・民俗学'
        }
      }
    ]
  },
  {
    'class': '社会科学',
    'subclasses': [
      {
        'subclass': '法学',
        'fields': {
          '3601': '基礎法学',
          '3602': '公法学',
          '3603': '国際法学',
          '3604': '社会法学',
          '3605': '刑事法学',
          '3606': '民事法学',
          '3607': '新領域法学'
        }
      },
      {
        'subclass': '政治学',
        'fields': {
          '3701': '政治学',
          '3702': '国際関係論'
        }
      },
      {
        'subclass': '経済学',
        'fields': {
          '3801': '理論経済学',
          '3802': '経済学説・経済思想',
          '3803': '経済統計',
          '3804': '経済政策',
          '3805': '財政・公共経済',
          '3806': '金融・ファイナンス',
          '3807': '経済史'
        }
      },
      {
        'subclass': '経営学',
        'fields': {
          '3901': '経営学',
          '3902': '商学',
          '3903': '会計学'
        }
      },
      {
        'subclass': '社会学',
        'fields': {
          '4001': '社会学',
          '4002': '社会福祉学'
        }
      },
      {
        'subclass': '心理学',
        'fields': {
          '4101': '社会心理学',
          '4102': '教育心理学',
          '4103': '臨床心理学',
          '4104': '実験心理学'
        }
      },
      {
        'subclass': '教育学',
        'fields': {
          '4201': '教育学',
          '4202': '教育社会学',
          '4203': '教科教育学',
          '4204': '特別支援教育'
        }
      }
    ]
  },
  {
    'class': '総合理工',
    'subclasses': [
      {
        'subclass': 'ナノ・マイクロ科学',
        'fields': {
          '4301': 'ナノ構造化学',
          '4302': 'ナノ構造物理',
          '4303': 'ナノ材料化学',
          '4304': 'ナノ材料工学',
          '4305': 'ナノバイオサイエンス',
          '4306': 'ナノマイクロシステム'
        }
      },
      {
        'subclass': '応用物理学',
        'fields': {
          '4401': '応用物性',
          '4402': '結晶工学',
          '4403': '薄膜・表面界面物性',
          '4404': '光工学・光量子科学',
          '4405': 'プラズマエレクトロニクス',
          '4406': '応用物理学一般'
        }
      },
      {
        'subclass': '量子ビーム科学',
        'fields': {
          '4501': '量子ビーム科学'
        }
      },
      {
        'subclass': '計算科学',
        'fields': {
          '4601': '計算科学'
        }
      }
    ]
  },
  {
    'class': '数物系科学',
    'subclasses': [
      {
        'subclass': '数学',
        'fields': {
          '4701': '代数学',
          '4702': '幾何学',
          '4703': '解析学基礎',
          '4704': '数学解析',
          '4705': '数学基礎・応用数学'
        }
      },
      {
        'subclass': '天文学',
        'fields': {
          '4801': '天文学'
        }
      },
      {
        'subclass': '物理学',
        'fields': {
          '4901': '素粒子・原子核・宇宙線・宇宙物理',
          '4902': '物性Ⅰ',
          '4903': '物性Ⅱ',
          '4904': '数理物理・物性基礎',
          '4905': '原子・分子・量子エレクトロニクス',
          '4906': '生物物理・化学物理・ソフトマターの物理'
        }
      },
      {
        'subclass': '地球惑星科学',
        'fields': {
          '5001': '固体地球惑星物理学',
          '5002': '気象・海洋物理・陸水学',
          '5003': '超高層物理学',
          '5004': '地質学',
          '5005': '層位・古生物学',
          '5006': '岩石・鉱物・鉱床学',
          '5007': '地球宇宙化学'
        }
      },
      {
        'subclass': 'プラズマ科学',
        'fields': {
          '5101': 'プラズマ科学'
        }
      }
    ]
  },
  {
    'class': '化学',
    'subclasses': [
      {
        'subclass': '基礎化学',
        'fields': {
          '5201': '物理化学',
          '5202': '有機化学',
          '5203': '無機化学'
        }
      },
      {
        'subclass': '複合化学',
        'fields': {
          '5301': '機能物性化学',
          '5302': '合成化学',
          '5303': '高分子化学',
          '5304': '分析化学',
          '5305': '生体関連化学',
          '5306': 'グリーン・環境化学',
          '5307': 'エネルギー関連化学'
        }
      },
      {
        'subclass': '材料化学',
        'fields': {
          '5401': '有機・ハイブリッド材料',
          '5402': '高分子・繊維材料',
          '5403': '無機工業材料',
          '5404': 'デバイス関連化学'
        }
      }
    ]
  },
  {
    'class': '工学',
    'subclasses': [
      {
        'subclass': '機械工学',
        'fields': {
          '5501': '機械材料・材料力学',
          '5502': '生産工学・加工学',
          '5503': '設計工学・機械機能要素・トライボロジー',
          '5504': '流体工学',
          '5505': '熱工学',
          '5506': '機械力学・制御',
          '5507': '知能機械学・機械システム'
        }
      },
      {
        'subclass': '電気電子工学',
        'fields': {
          '5601': '電力工学・電力変換・電気機器',
          '5602': '電子・電気材料工学',
          '5603': '電子デバイス・電子機器',
          '5604': '通信・ネットワーク工学',
          '5605': '計測工学',
          '5606': '制御・システム工学'
        }
      },
      {
        'subclass': '土木工学',
        'fields': {
          '5701': '土木材料・施工・建設マネジメント',
          '5702': '構造工学・地震工学・維持管理工学',
          '5703': '地盤工学',
          '5704': '水工学',
          '5705': '土木計画学・交通工学',
          '5706': '土木環境システム'
        }
      },
      {
        'subclass': '建築学',
        'fields': {
          '5801': '建築構造・材料',
          '5802': '建築環境・設備',
          '5803': '都市計画・建築計画',
          '5804': '建築史・意匠'
        }
      },
      {
        'subclass': '材料工学',
        'fields': {
          '5901': '金属物性・材料',
          '5902': '無機材料・物性',
          '5903': '複合材料・表界面工学',
          '5904': '構造・機能材料',
          '5905': '材料加工・組織制御工学',
          '5906': '金属・資源生産工学'
        }
      },
      {
        'subclass': 'プロセス・化学工学',
        'fields': {
          '6001': '化工物性・移動操作・単位操作',
          '6002': '反応工学・プロセスシステム',
          '6003': '触媒・資源化学プロセス',
          '6004': '生物機能・バイオプロセス'
        }
      },
      {
        'subclass': '総合工学',
        'fields': {
          '6101': '航空宇宙工学',
          '6102': '船舶海洋工学',
          '6103': '地球・資源システム工学',
          '6104': '核融合学',
          '6105': '原子力学',
          '6106': 'エネルギー学'
        }
      }
    ]
  },
  {
    'class': '総合生物',
    'subclasses': [
      {
        'subclass': '神経科学',
        'fields': {
          '6201': '神経生理学・神経科学一般',
          '6202': '神経解剖学・神経病理学',
          '6203': '神経化学・神経薬理学'
        }
      },
      {
        'subclass': '実験動物学',
        'fields': {
          '6301': '実験動物学'
        }
      },
      {
        'subclass': '腫瘍学',
        'fields': {
          '6401': '腫瘍生物学',
          '6402': '腫瘍診断学',
          '6403': '腫瘍治療学'
        }
      },
      {
        'subclass': 'ゲノム科学',
        'fields': {
          '6501': 'ゲノム生物学',
          '6502': 'ゲノム医科学',
          '6503': 'システムゲノム科学'
        }
      },
      {
        'subclass': '生物資源保全学',
        'fields': {
          '6601': '生物資源保全学'
        }
      }
    ]
  },
  {
    'class': '生物学',
    'subclasses': [
      {
        'subclass': '生物科学',
        'fields': {
          '6701': '分子生物学',
          '6702': '構造生物化学',
          '6703': '機能生物化学',
          '6704': '生物物理学',
          '6705': '細胞生物学',
          '6706': '発生生物学'
        }
      },
      {
        'subclass': '基礎生物学',
        'fields': {
          '6801': '植物分子・生理科学',
          '6802': '形態・構造',
          '6803': '動物生理・行動',
          '6804': '遺伝・染色体動態',
          '6805': '進化生物学',
          '6806': '生物多様性・分類',
          '6807': '生態・環境'
        }
      },
      {
        'subclass': '人類学',
        'fields': {
          '6901': '自然人類学',
          '6902': '応用人類学'
        }
      }
    ]
  },
  {
    'class': '農学',
    'subclasses': [
      {
        'subclass': '生産環境農学',
        'fields': {
          '7001': '遺伝育種科学',
          '7002': '作物生産科学',
          '7003': '園芸科学',
          '7004': '植物保護科学'
        }
      },
      {
        'subclass': '農芸化学',
        'fields': {
          '7101': '植物栄養学・土壌学',
          '7102': '応用微生物学',
          '7103': '応用生物化学',
          '7104': '生物有機化学',
          '7105': '食品科学'
        }
      },
      {
        'subclass': '森林圏科学',
        'fields': {
          '7201': '森林科学',
          '7202': '木質科学'
        }
      },
      {
        'subclass': '水圏応用科学',
        'fields': {
          '7301': '水圏生産科学',
          '7302': '水圏生命科学'
        }
      },
      {
        'subclass': '社会経済農学',
        'fields': {
          '7401': '経営・経済農学',
          '7402': '社会・開発農学',
          '7501': '農業工学地域環境工学・計画学',
          '7502': '農業環境・情報工学'
        }
      },
      {
        'subclass': '動物生命科学',
        'fields': {
          '7601': '動物生産科学',
          '7602': '獣医学',
          '7603': '統合動物科学'
        }
      },
      {
        'subclass': '境界農学',
        'fields': {
          '7701': '昆虫科学',
          '7702': '環境農学（含ランドスケープ科学）',
          '7703': '応用分子細胞生物学'
        }
      }
    ]
  },
  {
    'class': '医歯薬学',
    'subclasses': [
      {
        'subclass': '薬学',
        'fields': {
          '7801': '化学系薬学',
          '7802': '物理系薬学',
          '7803': '生物系薬学',
          '7804': '薬理系薬学',
          '7805': '天然資源系薬学',
          '7806': '創薬化学',
          '7807': '環境・衛生系薬学',
          '7808': '医療系薬学'
        }
      },
      {
        'subclass': '基礎医学',
        'fields': {
          '7901': '解剖学一般（含組織学・発生学）',
          '7902': '生理学一般',
          '7903': '環境生理学（含体力医学・栄養生理学）',
          '7904': '薬理学一般',
          '7905': '医化学一般',
          '7906': '病態医化学',
          '7907': '人類遺伝学',
          '7908': '人体病理学',
          '7909': '実験病理学',
          '7910': '寄生虫学（含衛生動物学）',
          '7911': '細菌学（含真菌学）',
          '7912': 'ウイルス学',
          '7913': '免疫学'
        }
      },
      {
        'subclass': '境界医学',
        'fields': {
          '8001': '医療社会学',
          '8002': '応用薬理学',
          '8003': '病態検査学',
          '8004': '疼痛学',
          '8005': '医学物理学・放射線技術学'
        }
      },
      {
        'subclass': '社会医学',
        'fields': {
          '8101': '疫学・予防医学',
          '8102': '衛生学・公衆衛生学',
          '8103': '病院・医療管理学',
          '8104': '法医学'
        }
      },
      {
        'subclass': '内科系臨床医学',
        'fields': {
          '8201': '内科学一般（含心身医学）',
          '8202': '消化器内科学',
          '8203': '循環器内科学',
          '8204': '呼吸器内科学',
          '8205': '腎臓内科学',
          '8206': '神経内科学',
          '8207': '代謝学',
          '8208': '内分泌学',
          '8209': '血液内科学',
          '8210': '膠原病・アレルギー内科学',
          '8211': '感染症内科学',
          '8212': '小児科学',
          '8213': '胎児・新生児医学',
          '8214': '皮膚科学',
          '8215': '精神神経科学',
          '8216': '放射線科学'
        }
      },
      {
        'subclass': '外科系臨床医学',
        'fields': {
          '8301': '外科学一般',
          '8302': '消化器外科学',
          '8303': '心臓血管外科学',
          '8304': '呼吸器外科学',
          '8305': '脳神経外科学',
          '8306': '整形外科学',
          '8307': '麻酔科学',
          '8308': '泌尿器科学',
          '8309': '産婦人科学',
          '8310': '耳鼻咽喉科学',
          '8311': '眼科学',
          '8312': '小児外科学',
          '8313': '形成外科学',
          '8314': '救急医学'
        }
      },
      {
        'subclass': '歯学',
        'fields': {
          '8401': '形態系基礎歯科学',
          '8402': '機能系基礎歯科学',
          '8403': '病態科学系歯学・歯科放射線学',
          '8404': '保存治療系歯学',
          '8405': '補綴・理工系歯学',
          '8406': '歯科医用工学・再生歯学',
          '8407': '外科系歯学',
          '8408': '矯正・小児系歯学',
          '8409': '歯周治療系歯学',
          '8410': '社会系歯学'
        }
      },
      {
        'subclass': '看護学',
        'fields': {
          '8501': '基礎看護学',
          '8502': '臨床看護学',
          '8503': '生涯発達看護学',
          '8504': '高齢看護学',
          '8505': '地域看護学'
        }
      }
    ]
  },
  {
    'class': '時限',
    'subclasses': [
      {
        'subclass': '',
        'fields': {
          '9055': '震災問題と人文学・社会科学'
        }
      }
    ]
  }
]
